In [ ]:
[문제142] 이름이 g 로 끝나는 사원들의 이름, 급여 출력하세요

In [1]:
import pandas as pd
from pandas import Series,DataFrame

emp = pd.read_csv("c:\python\emp1.csv",
                 names=["empid","name","jov","mgr","hire_date","sal","comm","deptno"])

In [4]:
#lambda
emp.loc[emp['name'].apply(lambda x : x[-1].lower())=='g',['name','sal']]

         name      sal
0        King  24000.0
8   Greenberg  13208.8
22   Kaufling   7900.0
37     Ladwig   3600.0
56       King  10000.0
88      Chung   3800.0

In [6]:
# 함수 사용
def ini(x):
    if x[-1] == 'g':
        return True
    else:
        return False
    
emp.loc[emp['name'].apply(ini),['name','sal']]

         name      sal
0        King  24000.0
8   Greenberg  13208.8
22   Kaufling   7900.0
37     Ladwig   3600.0
56       King  10000.0
88      Chung   3800.0

In [ ]:
[문제143] 110번 사원의 급여보다 많이 받는 사원의 이름, 급여 출력하세요.

In [15]:
emp = pd.read_csv("c:\python\emp1.csv",
                 names=["empid","name","jov","mgr","hire_date","sal","comm","deptno"])
sal = emp['sal'][emp['empid']==110]
emp.loc[emp['sal'] > float(sal),['name','sal']]

           name      sal
0          King  24000.0
1       Kochhar  17000.0
2       De Haan  17000.0
3        Hunold   9000.0
8     Greenberg  13208.8
9        Faviet   9900.0
14     Raphaely  11000.0
45      Russell  14000.0
46     Partners  13500.0
47    Errazuriz  12000.0
48    Cambrault  11000.0
49      Zlotkey  10500.0
50       Tucker  10000.0
51    Bernstein   9500.0
52         Hall   9000.0
56         King  10000.0
57        Sully   9500.0
58       McEwen   9000.0
62      Vishney  10500.0
63       Greene   9500.0
68         Ozer  11500.0
69        Bloom  10000.0
70          Fox   9600.0
74         Abel  11000.0
75       Hutton   8800.0
76       Taylor   8600.0
77   Livingston   8400.0
101   Hartstein  13000.0
104        Baer  10000.0
105     Higgins  12008.0
106       Gietz   8300.0

In [21]:
emp.values[0]

array([100, 'King', 'AD_PRES', nan, '2003-06-17', 24000.0, nan, 90.0],
      dtype=object)

In [22]:
emp.columns[:]

Index(['empid', 'name', 'jov', 'mgr', 'hire_date', 'sal', 'comm', 'deptno'], dtype='object')

In [ ]:
[문제144]관리자 사원의 이름, 입사일, 급여 출력하세요.

In [ ]:
emp=pd.read_csv("c:\R\emp.csv",
                names=["empid","name","job","mgr","hire_date","sal","comm","deptno"])

In [118]:
set_mgr = set(emp['mgr'])
set_mgr

{nan,
 100.0,
 101.0,
 102.0,
 103.0,
 108.0,
 114.0,
 120.0,
 121.0,
 122.0,
 123.0,
 124.0,
 145.0,
 146.0,
 147.0,
 148.0,
 149.0,
 201.0,
 205.0}

In [120]:
emp[['name','empid','hire_date','sal']][emp['empid'].isin(set_mgr)]

          name  empid   hire_date      sal
0         King    100  2003-06-17  24000.0
1      Kochhar    101  2005-09-21  17000.0
2      De Haan    102  2001-01-13  17000.0
3       Hunold    103  2006-01-03   9000.0
8    Greenberg    108  2002-08-17  13208.8
14    Raphaely    114  2002-12-07  11000.0
20       Weiss    120  2004-07-18   8000.0
21       Fripp    121  2005-04-10   8200.0
22    Kaufling    122  2003-05-01   7900.0
23     Vollman    123  2005-10-10   6500.0
24     Mourgos    124  2007-11-16   5800.0
45     Russell    145  2004-10-01  14000.0
46    Partners    146  2005-01-05  13500.0
47   Errazuriz    147  2005-03-10  12000.0
48   Cambrault    148  2007-10-15  11000.0
49     Zlotkey    149  2008-01-29  10500.0
101  Hartstein    201  2004-02-17  13000.0
105    Higgins    205  2002-06-07  12008.0

In [122]:
import  csv

file = open("c:\python\emp1.csv",'r')
emp_csv = csv.reader(file)
v_mgr = []
for emp_list in emp_csv:
    if (not emp_list[3] in v_mgr) & (emp_list[3] != ''):
        v_mgr.append(emp_list[3])
        
print(len(v_mgr))

18

In [124]:
file = open("c:\python\emp1.csv",'r')
emp_csv = csv.reader(file)
for emp_list in emp_csv:
    for mgr in v_mgr:
        if emp_list[0] == mgr:
            print(emp_list[1],  emp_list[4], emp_list[5])

King 2003-06-17 24000
Kochhar 2005-09-21 17000
De Haan 2001-01-13 17000
Hunold 2006-01-03 9000
Greenberg 2002-08-17 13208.8
Raphaely 2002-12-07 11000
Weiss 2004-07-18 8000
Fripp 2005-04-10 8200
Kaufling 2003-05-01 7900
Vollman 2005-10-10 6500
Mourgos 2007-11-16 5800
Russell 2004-10-01 14000
Partners 2005-01-05 13500
Errazuriz 2005-03-10 12000
Cambrault 2007-10-15 11000
Zlotkey 2008-01-29 10500
Hartstein 2004-02-17 13000
Higgins 2002-06-07 12008

In [ ]:

#[선생님]

import  pandas  as  pd
emp = pd.read_csv("c:\data\emp.csv", names = ['empid','name','job','mgr','hire_date','sal','comm','deptno'])
print(emp[['name','hire_date','sal']][emp['empid'].isin (emp['mgr'])])

In [ ]:
[문제145]  101번 사원의 관리자 이름, 입사일, 급여정보를 출력하세요.

In [34]:
maid = emp['mgr'][emp['empid']==101].values[0] 
emp[['name','hire_date','sal']][emp['empid']== maid]

   name   hire_date      sal
0  King  2003-06-17  24000.0

In [ ]:
############################################################################

In [36]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [37]:
# s변수 입력
s =  Series([2,4,8,np.nan,6])
s

0    2.0
1    4.0
2    8.0
3    NaN
4    6.0
dtype: float64

In [38]:
s.sum()

20.0

In [39]:
s.sum(skipna=True)  # NULL 있어도 계산 하겠어

20.0

In [40]:
s.sum(skipna=False) # NULL 있으면 계산 안하겠어

nan

In [41]:
s.mean()  #평균

5.0

In [43]:
s.var()  #분산

6.666666666666667

In [44]:
s.std()   #표준편차

2.581988897471611

In [45]:
s.max()

8.0

In [46]:
s.min()

2.0

In [47]:
s.cumsum()  #누적합

0     2.0
1     6.0
2    14.0
3     NaN
4    20.0
dtype: float64

In [48]:
s.idxmin()   # 가장 적은 값이 들어있는 인덱스 번호

0

In [49]:
s.idxmax()   # 가장 큰값이 들어있는 인덱스 번호

2

In [50]:
s[s.idxmin()]   #  idxmin 값 뽑아보기

2.0

In [51]:
s[s.idxmax()]   #  idxmax 값 뽑아보기

8.0

In [52]:
s.describe    #  4분위 수

<bound method NDFrame.describe of 0    2.0
1    4.0
2    8.0
3    NaN
4    6.0
dtype: float64>

In [56]:
s.count()   # NULL을 제외한 건수가 나옴

4

In [ ]:
len(s)    #  NULL을 포함한 건수가 나옴

In [65]:
df = DataFrame([[60,80,70],[50,75,83],[90,83,81]],
              index = ['홍길동','박찬호','손흥민'],
              columns = ['영어','수학','국어'])
df

     영어  수학  국어
홍길동  60  80  70
박찬호  50  75  83
손흥민  90  83  81

In [59]:
df.sum()

영어    200
수학    238
국어    234
dtype: int64

In [60]:
df.sum(axis=0) # 열을 기준으로 더하기

영어    200
수학    238
국어    234
dtype: int64

In [61]:
df.sum(axis=1) #행을 기준으로 더하기

홍길동    210
박찬호    208
손흥민    254
dtype: int64

In [62]:
df.mean()

영어    66.666667
수학    79.333333
국어    78.000000
dtype: float64

In [63]:
df.mean(axis=1) # 행을 기준으로 평균 구하기

홍길동    70.000000
박찬호    69.333333
손흥민    84.666667
dtype: float64

In [76]:
# 데이터 프레임에 제임스 추가
df.loc['제임스',['영어','수학','국어']] = [100,np.nan,90]
df

        영어    수학    국어
홍길동   60.0  80.0  70.0
박찬호   50.0  75.0  83.0
손흥민   90.0  83.0  81.0
제임스  100.0   NaN  90.0

In [ ]:
df.at['제임스','영어']=100
df.at['제임스','수학']=np.nan
df.at['제임스','국어']=90

In [85]:
df.loc['제임'] = [100,np.nan,90]
df

        영어    수학    국어
홍길동   60.0  80.0  70.0
박찬호   50.0  75.0  83.0
손흥민   90.0  83.0  81.0
제임스  100.0   NaN  90.0
제임   100.0   NaN  90.0

In [86]:
# '제임' 행 지우기
df = df.drop('제임')     
#df = df.drop('제임',axis=0)

In [87]:
df

        영어    수학    국어
홍길동   60.0  80.0  70.0
박찬호   50.0  75.0  83.0
손흥민   90.0  83.0  81.0
제임스  100.0   NaN  90.0

In [88]:
df.sum()

영어    300.0
수학    238.0
국어    324.0
dtype: float64

In [89]:
df.mean()

영어    75.000000
수학    79.333333
국어    81.000000
dtype: float64

In [90]:
df.mean(axis=1)

홍길동    70.000000
박찬호    69.333333
손흥민    84.666667
제임스    95.000000
dtype: float64

In [91]:
df.mean(skipna=False)

영어    75.0
수학     NaN
국어    81.0
dtype: float64

In [92]:
df.mean(axis=1, skipna=False)

홍길동    70.000000
박찬호    69.333333
손흥민    84.666667
제임스          NaN
dtype: float64

In [94]:
df.mean(axis=1, skipna=False)

홍길동    70.000000
박찬호    69.333333
손흥민    84.666667
제임스          NaN
dtype: float64

In [97]:
df.mean(axis=1, skipna=False).idxmax()

'손흥민'

In [98]:
df.idxmax()

영어    제임스
수학    손흥민
국어    제임스
dtype: object

In [ ]:
[문제146] 최고 급여, 최저 급여 출력하세요.

In [99]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np

emp = pd.read_csv("c:\python\emp1.csv",
                 names=['empid','name','job','mgr','hire_date','sal','comm','deptno'])
emp

     empid         name         job    mgr   hire_date      sal  comm  deptno
0      100         King     AD_PRES    NaN  2003-06-17  24000.0   NaN    90.0
1      101      Kochhar       AD_VP  100.0  2005-09-21  17000.0   NaN    90.0
2      102      De Haan       AD_VP  100.0  2001-01-13  17000.0   NaN    90.0
3      103       Hunold     IT_PROG  102.0  2006-01-03   9000.0   NaN    60.0
4      104        Ernst     IT_PROG  103.0  2007-05-21   6000.0   NaN    60.0
5      105       Austin     IT_PROG  103.0  2005-06-25   4800.0   NaN    60.0
6      106    Pataballa     IT_PROG  103.0  2006-02-05   4800.0   NaN    60.0
7      107      Lorentz     IT_PROG  103.0  2007-02-07   4200.0   NaN    60.0
8      108    Greenberg      FI_MGR  101.0  2002-08-17  13208.8   NaN   100.0
9      109       Faviet  FI_ACCOUNT  108.0  2002-08-16   9900.0   NaN   100.0
10     110         Chen  FI_ACCOUNT  108.0  2005-09-28   8200.0   NaN   100.0
11     111      Sciarra  FI_ACCOUNT  108.0  2005-09-30   7700.0   NaN   100.0
12     112        Urman  FI_ACCOUNT  108.0  2006-03-07   7800.0   NaN   100.0
13     113         Popp  FI_ACCOUNT  108.0  2007-12-07   6900.0   NaN   100.0
14     114     Raphaely      PU_MAN  100.0  2002-12-07  11000.0   NaN    30.0
15     115         Khoo    PU_CLERK  114.0  2003-05-18   3100.0   NaN    30.0
16     116        Baida    PU_CLERK  114.0  2005-12-24   2900.0   NaN    30.0
17     117       Tobias    PU_CLERK  114.0  2005-07-24   2800.0   NaN    30.0
18     118       Himuro    PU_CLERK  114.0  2006-11-15   2600.0   NaN    30.0
19     119     Colmeres    PU_CLERK  114.0  2007-08-10   2500.0   NaN    30.0
20     120        Weiss      ST_MAN  100.0  2004-07-18   8000.0   NaN    50.0
21     121        Fripp      ST_MAN  100.0  2005-04-10   8200.0   NaN    50.0
22     122     Kaufling      ST_MAN  100.0  2003-05-01   7900.0   NaN    50.0
23     123      Vollman      ST_MAN  100.0  2005-10-10   6500.0   NaN    50.0
24     124      Mourgos      ST_MAN  100.0  2007-11-16   5800.0   NaN    50.0
25     125          yer    ST_CLERK  120.0  2005-07-16   3200.0   NaN    50.0
26     126  Mikkilineni    ST_CLERK  120.0  2006-09-28   2700.0   NaN    50.0
27     127       Landry    ST_CLERK  120.0  2007-01-14   2400.0   NaN    50.0
28     128       Markle    ST_CLERK  120.0  2008-03-08   2200.0   NaN    50.0
29     129       Bissot    ST_CLERK  121.0  2005-08-20   3300.0   NaN    50.0
..     ...          ...         ...    ...         ...      ...   ...     ...
77     177   Livingston      SA_REP  149.0  2006-04-23   8400.0  0.20    80.0
78     178        Grant      SA_REP  149.0  2007-05-24   7000.0  0.15     NaN
79     179      Johnson      SA_REP  149.0  2008-01-04   6200.0  0.10    80.0
80     180       Taylor    SH_CLERK  120.0  2006-01-24   3200.0   NaN    50.0
81     181       Fleaur    SH_CLERK  120.0  2006-02-23   3100.0   NaN    50.0
82     182     Sullivan    SH_CLERK  120.0  2007-06-21   2500.0   NaN    50.0
83     183        Geoni    SH_CLERK  120.0  2008-02-03   2800.0   NaN    50.0
84     184     Sarchand    SH_CLERK  121.0  2004-01-27   4200.0   NaN    50.0
85     185         Bull    SH_CLERK  121.0  2005-02-20   4100.0   NaN    50.0
86     186    Dellinger    SH_CLERK  121.0  2006-06-24   3400.0   NaN    50.0
87     187       Cabrio    SH_CLERK  121.0  2007-02-07   3000.0   NaN    50.0
88     188        Chung    SH_CLERK  122.0  2005-06-14   3800.0   NaN    50.0
89     189        Dilly    SH_CLERK  122.0  2005-08-13   3600.0   NaN    50.0
90     190        Gates    SH_CLERK  122.0  2006-07-11   2900.0   NaN    50.0
91     191      Perkins    SH_CLERK  122.0  2007-12-19   2500.0   NaN    50.0
92     192         Bell    SH_CLERK  123.0  2004-02-04   4000.0   NaN    50.0
93     193      Everett    SH_CLERK  123.0  2005-03-03   3900.0   NaN    50.0
94     194       McCain    SH_CLERK  123.0  2006-07-01   3200.0   NaN    50.0
95     195        Jones    SH_CLERK  123.0  2007-03-17   2800.0   NaN    50.0
96     196        Walsh    SH_CLERK  124.0  2006-04-24   3100.0   NaN    50.0
97     197       Feeney    SH_CLERK  124.0  2006-05-23   3000.0   NaN    50.0
98     198     OConnell    SH_CLERK  124.0  2007-06-21   2600.0   NaN    50.0
99     199        Grant    SH_CLERK  124.0  2008-01-13   2600.0   NaN    50.0
100    200       Whalen     AD_ASST  101.0  2003-09-17   4400.0   NaN    10.0
101    201    Hartstein      MK_MAN  100.0  2004-02-17  13000.0   NaN    20.0
102    202          Fay      MK_REP  201.0  2005-08-17   6000.0   NaN    20.0
103    203       Mavris      HR_REP  101.0  2002-06-07   6500.0   NaN    40.0
104    204         Baer      PR_REP  101.0  2002-06-07  10000.0   NaN    70.0
105    205      Higgins      AC_MGR  101.0  2002-06-07  12008.0   NaN   510.0
106    206        Gietz  AC_ACCOUNT  205.0  2002-06-07   8300.0   NaN   110.0

[107 rows x 8 columns]

In [104]:
emp[['name','sal']][emp['sal']== emp['sal'].max()]

   name      sal
0  King  24000.0

In [105]:
emp['sal'].max()

24000.0

In [106]:
emp['sal'].min()

2100.0

In [107]:
import  csv

file = open("c:\python\emp1.csv",'r')
emp_csv = csv.reader(file)
sal = 0
for emp_list in emp_csv:
    if float(emp_list[5]) > float(sal) :
        sal = emp_list[5]
print(sal)

24000

In [ ]:
import  csv

file = open("c:\python\emp1.csv",'r')
emp_csv = csv.reader(file)
sal = 100000000
for emp_list in emp_csv:
    if float(emp_list[5]) < float(sal) :
        sal = emp_list[5]
print(sal)

In [ ]:
import  csv

file = open("c:\python\emp1.csv",'r')
emp_csv = csv.reader(file)
sal = []
for emp_list in emp_csv:
    sal.append(float(emp_list[5]))
print(max(sal))
print(min(sal))

In [ ]:
[문제147] 20번 부서 사원들의 급여 합을 구하세요.

In [110]:
emp.columns[:]

Index(['empid', 'name', 'job', 'mgr', 'hire_date', 'sal', 'comm', 'deptno'], dtype='object')

In [112]:
emp['sal'][emp['deptno']==20].sum()

19000.0

In [113]:
import  csv

file = open("c:\python\emp1.csv",'r')
emp_csv = csv.reader(file)
sal = 0
for emp_list in emp_csv:
    if emp_list[7] == '20':
        sal += float(emp_list[5])
print(sal)

19000.0

In [ ]:
[문제148] 부서번호를 입력하면 그 부서의 급여 총액을 구하는 함수를 생성하세요.

In [3]:
import pandas as pd
from pandas import Series,DataFrame
import numpy as np
from numpy import *



def sumSal():
    emp = pd.read_csv("c:\python\emp1.csv",
                 names=['empid', 'name', 'job', 'mgr', 'hire_date', 'sal', 'comm', 'deptno'])
    x = int(input('부서번호를 입력하세요 :' ))

    return emp['sal'][emp['deptno']==x].sum(skipna=False)

In [4]:
sumSal()

부서번호를 입력하세요 :100

53708.8

In [142]:
# [선생님]
def dept_sum_sal():
    emp = pd.read_csv("c:\python\emp1.csv", names = ['empid','name','job','mgr','hire_date','sal','comm','deptno'])
    id = input('부서번호를 입력하세요 :  ')
    print(emp[['sal']][emp['deptno'] == int(id)].sum().values[0])
    print(emp.loc[emp['deptno'] == int(id), 'sal'].sum())

dept_sum_sal()

부서번호를 입력하세요 :  100
53708.8
53708.8

In [146]:
###위 답에서
## print(emp[['sal']][emp['deptno'] == int(id)].sum().values[0])

emp['sal'].sum()   # series로 결과가 나옴 ->sum하면 형은 numpy의 array로 바뀜

693516.8

In [145]:
emp[['sal']].sum() # dataframe으로 결과가나옴 -> sum하면 형은 Series로 바쓈

sal    693516.8
dtype: float64

In [155]:
emp[['sal']].sum().values[0] # dtype: float64 출력안하고 values만 출력

693516.8

In [ ]:
[문제149] 직업을 물어보게하고 직업을 입력하면 해당 직업의 최고 급여를 출력되게하는데 아무것도 입력하지 않으면 계속 물어보게하는
프로그램을 작성하세요.

job_max_sal()

직업을 입력하세요 ?  ST_CLERK
3600.0

job_max_sal()

직업을 입력하세요 ? sa_rep
11500.0

job_max_sal()

직업을 입력하세요 ? 

직업을 입력하세요 ? 

직업을 입력하세요 ? 

job_max_sal()

직업을 입력하세요 ? sales
해당 직업의 사원은 없습니다.

In [8]:
import pandas as pd

def job_max_sal():
    try:
        job = ""
        while job == "":
            job = input("직업을 입력하세요 ? ")
        emp = pd.read_csv("c:\python\emp1.csv",
                         names = ['empid','name','job','mgr','hire_date','sal','comm','deptno'])
        re = emp['sal'][emp['job']==job].max()
        if pd.isnull(re) == True:
            raise
        return re
    except Exception as err:
        print("해당 직업의 사원은 없습니다.")
        

job_max_sal()

직업을 입력하세요 ? ST_CLERK

3600.0

In [9]:
job_max_sal()

직업을 입력하세요 ?
직업을 입력하세요 ?
직업을 입력하세요 ? 1
해당 직업의 사원은 없습니다.